In [1]:
import pandas as pd

In [5]:
import warnings
warnings.filterwarnings('ignore')

### Data Types in Pandas
1. Series (1-D/ Single Column) *
2. DataFrame (2D/ Tabular Data) *
3. Panel (3D / MultiTable Data)

#### Creating Series

In [6]:
s = pd.Series([])

In [7]:
s

Series([], dtype: float64)

In [8]:
print(s)

Series([], dtype: float64)

In [9]:
type(s)

pandas.core.series.Series

In [10]:
s.dtype

dtype('float64')

In [11]:
s.size

0

In [12]:
s.shape

(0,)

In [13]:
s.head()

Series([], dtype: float64)

In [14]:
s.tail()

Series([], dtype: float64)

In [16]:
s.sample(0)

Series([], dtype: float64)

In [18]:
s1 = pd.Series([3,4,6,8,3,7,4,7,2,2,5,76,23,65,2,3,5,6,2,6,7,43,6,7,2,6,7,2,4,76,3,6,0,2,6,98,1,3,5,7])
s1

0      3
1      4
2      6
3      8
4      3
5      7
6      4
7      7
8      2
9      2
10     5
11    76
12    23
13    65
14     2
15     3
16     5
17     6
18     2
19     6
20     7
21    43
22     6
23     7
24     2
25     6
26     7
27     2
28     4
29    76
30     3
31     6
32     0
33     2
34     6
35    98
36     1
37     3
38     5
39     7
dtype: int64

In [20]:
s1.shape

(40,)

In [21]:
s1.size

40

In [22]:
s1.head()

0    3
1    4
2    6
3    8
4    3
dtype: int64

In [23]:
s1.tail()

35    98
36     1
37     3
38     5
39     7
dtype: int64

In [24]:
s1.head(10)

0    3
1    4
2    6
3    8
4    3
5    7
6    4
7    7
8    2
9    2
dtype: int64

In [25]:
s1.sample(5)

30    3
39    7
10    5
7     7
19    6
dtype: int64

In [26]:
s1.value_counts()

2     7
6     7
7     6
3     5
4     3
5     3
76    2
0     1
65    1
8     1
23    1
98    1
43    1
1     1
dtype: int64

In [27]:
s1.unique()

array([ 3,  4,  6,  8,  7,  2,  5, 76, 23, 65, 43,  0, 98,  1],
      dtype=int64)

In [28]:
s1.nunique()

14

In [29]:
len(s1.unique())

14

In [30]:
s1.values

array([ 3,  4,  6,  8,  3,  7,  4,  7,  2,  2,  5, 76, 23, 65,  2,  3,  5,
        6,  2,  6,  7, 43,  6,  7,  2,  6,  7,  2,  4, 76,  3,  6,  0,  2,
        6, 98,  1,  3,  5,  7], dtype=int64)

In [31]:
s1.values.tolist()

[3,
 4,
 6,
 8,
 3,
 7,
 4,
 7,
 2,
 2,
 5,
 76,
 23,
 65,
 2,
 3,
 5,
 6,
 2,
 6,
 7,
 43,
 6,
 7,
 2,
 6,
 7,
 2,
 4,
 76,
 3,
 6,
 0,
 2,
 6,
 98,
 1,
 3,
 5,
 7]

In [32]:
s2 = pd.Series({'a':30,'b':40,'c':10})
s2

a    30
b    40
c    10
dtype: int64

In [34]:
s3 = pd.Series({'a':[35,30,60],'b':[45,40],'c':[15,10]})
s3

a    [35, 30, 60]
b        [45, 40]
c        [15, 10]
dtype: object

In [38]:
list('xyzpqr')

['x', 'y', 'z', 'p', 'q', 'r']

In [40]:
s4 = pd.Series([4,7,8,7,3,9],index=list('xyzpqr'),name='Data')
s4

x    4
y    7
z    8
p    7
q    3
r    9
Name: Data, dtype: int64

In [41]:
s4.sum()

38

In [42]:
s4.max()

9

In [44]:
s4.idxmax()

'r'

#### Accessing/Modifying Series Values

In [45]:
s1

0      3
1      4
2      6
3      8
4      3
5      7
6      4
7      7
8      2
9      2
10     5
11    76
12    23
13    65
14     2
15     3
16     5
17     6
18     2
19     6
20     7
21    43
22     6
23     7
24     2
25     6
26     7
27     2
28     4
29    76
30     3
31     6
32     0
33     2
34     6
35    98
36     1
37     3
38     5
39     7
dtype: int64

In [46]:
s1[5]

7

In [47]:
s1[5] = 77

In [48]:
del s1[6]

In [50]:
s1

0      3
1      4
2      6
3      8
4      3
5     77
7      7
8      2
9      2
10     5
11    76
12    23
13    65
14     2
15     3
16     5
17     6
18     2
19     6
20     7
21    43
22     6
23     7
24     2
25     6
26     7
27     2
28     4
29    76
30     3
31     6
32     0
33     2
34     6
35    98
36     1
37     3
38     5
39     7
dtype: int64

In [52]:
s2

a    30
b    40
c    10
dtype: int64

In [53]:
s2['a']

30

In [54]:
s2[0]

30

In [55]:
s2[1]

40

In [56]:
s2['b']

40

In [57]:
s2['d'] = 99

In [58]:
s2

a    30
b    40
c    10
d    99
dtype: int64

### Creating DataFrame

In [61]:
d = pd.DataFrame()

In [62]:
d

Empty DataFrame
Columns: []
Index: []

In [63]:
type(d)

pandas.core.frame.DataFrame

In [64]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [65]:
len(d)

0

In [66]:
d.shape

(0, 0)

In [67]:
d.size

0

In [68]:
d.head()

Empty DataFrame
Columns: []
Index: []

In [69]:
d.head()

Empty DataFrame
Columns: []
Index: []

In [70]:
d.sample(0)

Empty DataFrame
Columns: []
Index: []

In [71]:
df = pd.DataFrame([3,4,5,8,9,4,6,8])
df

   0
0  3
1  4
2  5
3  8
4  9
5  4
6  6
7  8

In [73]:
df1 = pd.DataFrame({'age':[20,30],'name':['Harry','Jerry']})
df1

   age   name
0   20  Harry
1   30  Jerry

In [75]:
pd.DataFrame({'age':[20],'name':['Harry']})

   age   name
0   20  Harry

In [79]:
df2 = pd.DataFrame([[20,'Harry'],[30,'Jerry'],[26,'Merry']], columns = ['Age','Name'], index = ['x','y','z'])
df2

   Age   Name
x   20  Harry
y   30  Jerry
z   26  Merry

#### Accessing/Modifying DataFrame

In [80]:
df2['Age']

x    20
y    30
z    26
Name: Age, dtype: int64

In [81]:
df2['Name']

x    Harry
y    Jerry
z    Merry
Name: Name, dtype: object

In [85]:
df2.loc['x']

Age        20
Name    Harry
Name: x, dtype: object

In [88]:
df2.loc

In [89]:
df2.T

          x      y      z
Age      20     30     26
Name  Harry  Jerry  Merry

In [87]:
df2.T['x']

Age        20
Name    Harry
Name: x, dtype: object

In [90]:
df2

   Age   Name
x   20  Harry
y   30  Jerry
z   26  Merry

In [92]:
df2['Age']['x'] = 22

In [93]:
df2

   Age   Name
x   22  Harry
y   30  Jerry
z   26  Merry

In [94]:
df2['Extra'] = pd.Series([True,False,True])
df2

   Age   Name Extra
x   22  Harry   NaN
y   30  Jerry   NaN
z   26  Merry   NaN

In [95]:
df2['Extra'] = pd.Series([True,False,True],index=list('xyz'))
df2

   Age   Name  Extra
x   22  Harry   True
y   30  Jerry  False
z   26  Merry   True

In [96]:
df2['Extra'] = pd.Series([True,False,True],index=list('yzx'))
df2

   Age   Name  Extra
x   22  Harry   True
y   30  Jerry   True
z   26  Merry  False

In [97]:
df2['Extra'] = pd.Series([True,False,True,False],index=list('yzxp'))
df2

   Age   Name  Extra
x   22  Harry   True
y   30  Jerry   True
z   26  Merry  False

In [98]:
df2['Extra'] = pd.Series([True,False,True],index=list('yxp'))
df2

   Age   Name  Extra
x   22  Harry  False
y   30  Jerry   True
z   26  Merry    NaN

In [99]:
del df2['Extra']

In [100]:
df2

   Age   Name
x   22  Harry
y   30  Jerry
z   26  Merry

In [101]:
df2['Extra'] = pd.Series([True,False,True,False],index=list('yzxp'))
df2

   Age   Name  Extra
x   22  Harry   True
y   30  Jerry   True
z   26  Merry  False

In [102]:
df2[['Age','Extra']]

   Age  Extra
x   22   True
y   30   True
z   26  False

In [103]:
df2[['Age']]

   Age
x   22
y   30
z   26

In [104]:
df2.index

Index(['x', 'y', 'z'], dtype='object')

In [105]:
df2.columns

Index(['Age', 'Name', 'Extra'], dtype='object')

In [106]:
df2.values

array([[22, 'Harry', True],
       [30, 'Jerry', True],
       [26, 'Merry', False]], dtype=object)

In [107]:
df2.values.tolist()

[[22, 'Harry', True], [30, 'Jerry', True], [26, 'Merry', False]]

# Operations
1. Creating (done)
2. Accessing/Modifying (done)
3. File Handling
4. Statistical Functions
5. String/Text Functions
6. Iteration
7. Sorting
8. Data Aggregations/Groupby
9. Missing Data/ its Treatment
10. Merging/Joining/Concatenation
11. Date Time Functionality
12. Graphical Visualization

#### File Handling

# kaggle.com

In [110]:
pd.read_clipboard()

    A   B   C   D
1  56  72  58  75
2  17  71  38  85
3  87  94  80  17

In [111]:
# pd.read_clipboard
# pd.read_csv
# pd.read_excel
# pd.read_json
# pd.read_html
# pd.read_pickle